<?xml version="1.0" ?>
<net name="selfie_segmentation_landscape" version="10">
	<layers>
		<layer id="0" name="input_1:0" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 144, 256"/>
			<output>
				<port id="0" names="input_1:0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>144</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_1:0/scale_input_port_1/value161013116" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_1:0/scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>144</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>144</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv2D/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="34" shape="16, 3, 3, 3" size="864"/>
			<output>
				<port id="0" names="Conv2D/filter:0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv__158/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>144</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv__158/Dims3503" type="Const" version="opset1">
			<data element_type="f16" offset="898" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv__158" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__158:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="mul" type="HSigmoid" version="opset5">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="mul:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="mul_1:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv2D_2/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="930" shape="16, 16, 1, 1" size="512"/>
			<output>
				<port id="0" names="Conv2D_2/filter:0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv__161/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv__161/Dims3461" type="Const" version="opset1">
			<data element_type="f16" offset="1442" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv__161" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__161:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="re_lu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="const_fold_opt__377" type="Const" version="opset1">
			<data element_type="f16" offset="1474" shape="16, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" names="const_fold_opt__377" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv__162/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv__162/Dims3407" type="Const" version="opset1">
			<data element_type="f16" offset="1762" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv__162" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__162:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="re_lu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_1:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="352" type="Const" version="opset1">
			<data element_type="i64" offset="1794" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="22" name="global_average_pooling2d/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="global_average_pooling2d/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="global_average_pooling2d/input_rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" offset="1802" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="global_average_pooling2d/input_rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="26" name="354" type="Const" version="opset1">
			<data element_type="i64" offset="1810" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="27" name="global_average_pooling2d/global_pooling_reduce_axis" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="global_average_pooling2d/reduce" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="global_average_pooling2d:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv2D_3/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="1818" shape="8, 16, 1, 1" size="256"/>
			<output>
				<port id="0" names="Conv2D_3/filter:0" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv__165/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv__165/Dims3335" type="Const" version="opset1">
			<data element_type="f16" offset="2074" shape="1, 8, 1, 1" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv__165" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__165:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="re_lu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_2:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv2D_4/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="2090" shape="16, 8, 1, 1" size="256"/>
			<output>
				<port id="0" names="Conv2D_4/filter:0" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv__166/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv__166/Dims3437" type="Const" version="opset1">
			<data element_type="f16" offset="2346" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv__166" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__166:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="activation" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="multiply:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv2D_5/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="2378" shape="16, 16, 1, 1" size="512"/>
			<output>
				<port id="0" names="Conv2D_5/filter:0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv__167/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv__167/Dims3551" type="Const" version="opset1">
			<data element_type="f16" offset="2890" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv__167" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__167:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv2D_6/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="2922" shape="72, 16, 1, 1" size="2304"/>
			<output>
				<port id="0" names="Conv2D_6/filter:0" precision="FP16">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv__171/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv__171/Dims3299" type="Const" version="opset1">
			<data element_type="f16" offset="5226" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv__171" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__171:0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="re_lu_3" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_3:0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="const_fold_opt__387" type="Const" version="opset1">
			<data element_type="f16" offset="5370" shape="72, 1, 1, 3, 3" size="1296"/>
			<output>
				<port id="0" names="const_fold_opt__387" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv__172/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>36</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv__172/Dims3455" type="Const" version="opset1">
			<data element_type="f16" offset="6666" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv__172" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__172:0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="re_lu_4" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_4:0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv2D_7/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="6810" shape="24, 72, 1, 1" size="3456"/>
			<output>
				<port id="0" names="Conv2D_7/filter:0" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv__173/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv__173/Dims3491" type="Const" version="opset1">
			<data element_type="f16" offset="10266" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv__173" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__173:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv2D_8/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="10314" shape="88, 24, 1, 1" size="4224"/>
			<output>
				<port id="0" names="Conv2D_8/filter:0" precision="FP16">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv__176/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv__176/Dims3347" type="Const" version="opset1">
			<data element_type="f16" offset="14538" shape="1, 88, 1, 1" size="176"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv__176" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__176:0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="re_lu_5" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_5:0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="const_fold_opt__385" type="Const" version="opset1">
			<data element_type="f16" offset="14714" shape="88, 1, 1, 3, 3" size="1584"/>
			<output>
				<port id="0" names="const_fold_opt__385" precision="FP16">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv__177/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv__177/Dims3383" type="Const" version="opset1">
			<data element_type="f16" offset="16298" shape="1, 88, 1, 1" size="176"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv__177" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__177:0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="re_lu_6" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_6:0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv2D_9/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="16474" shape="24, 88, 1, 1" size="4224"/>
			<output>
				<port id="0" names="Conv2D_9/filter:0" precision="FP16">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv__178/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv__178/Dims3473" type="Const" version="opset1">
			<data element_type="f16" offset="20698" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv__178" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__178:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="add__xeno_compat__1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" names="add__xeno_compat__1:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv2D_10/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="20746" shape="96, 24, 1, 1" size="4608"/>
			<output>
				<port id="0" names="Conv2D_10/filter:0" precision="FP16">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv__183/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv__183/Dims3311" type="Const" version="opset1">
			<data element_type="f16" offset="25354" shape="1, 96, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv__183" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__183:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="mul_2" type="HSigmoid" version="opset5">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="mul_2:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="mul_3" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" names="mul_3:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="const_fold_opt__383" type="Const" version="opset1">
			<data element_type="f16" offset="25546" shape="96, 1, 1, 5, 5" size="4800"/>
			<output>
				<port id="0" names="const_fold_opt__383" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv__186/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="2, 2" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv__186/Dims3485" type="Const" version="opset1">
			<data element_type="f16" offset="30346" shape="1, 96, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv__186" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__186:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="mul_4" type="HSigmoid" version="opset5">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="mul_4:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="mul_5" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" names="mul_5:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="357" type="Const" version="opset1">
			<data element_type="i64" offset="1794" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="86" name="global_average_pooling2d_1/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="global_average_pooling2d_1/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="global_average_pooling2d_1/input_rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" offset="1802" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="global_average_pooling2d_1/input_rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="90" name="359" type="Const" version="opset1">
			<data element_type="i64" offset="1810" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="91" name="global_average_pooling2d_1/global_pooling_reduce_axis" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="global_average_pooling2d_1/reduce" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="global_average_pooling2d_1:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv2D_11/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="30538" shape="24, 96, 1, 1" size="4608"/>
			<output>
				<port id="0" names="Conv2D_11/filter:0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv__189/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv__189/Dims3329" type="Const" version="opset1">
			<data element_type="f16" offset="35146" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv__189" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__189:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="re_lu_7" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="re_lu_7:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv2D_12/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="35194" shape="96, 24, 1, 1" size="4608"/>
			<output>
				<port id="0" names="Conv2D_12/filter:0" precision="FP16">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv__190/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv__190/Dims3365" type="Const" version="opset1">
			<data element_type="f16" offset="39802" shape="1, 96, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv__190" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__190:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="activation_1" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_1:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="multiply_1:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv2D_13/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="39994" shape="32, 96, 1, 1" size="6144"/>
			<output>
				<port id="0" names="Conv2D_13/filter:0" precision="FP16">
					<dim>32</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv__191/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv__191/Dims3521" type="Const" version="opset1">
			<data element_type="f16" offset="46138" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv__191" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__191:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv2D_14/filter:0" type="Const" version="opset1">
			<data element_type="f16" offset="46202" shape="128, 32, 1, 1" size="8192"/>
			<output>
				<port id="0" names="Conv2D_14/filter:0" precision="FP16">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv__194/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv__194/Dims3605" type="Const" version="opset1">
			<data element_type="f16" offset="54394" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv__194" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__194:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="mul_6" type="HSigmoid" version="opset5">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="mul_6:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="mul_7" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" names="mul_7:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="const_fold_opt__381" type="Const" version="opset1">
			<data element_type="f16" offset="54650" shape="128, 1, 1, 5, 5" size="6400"/>
			<output>
				<port id="0" names="const_fold_opt__381" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv__197/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv__197/Dims3569" type="Const" version="opset1">
			<data element_type="f16" offset="61050" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv__197" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv__197:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="mul_8" type="HSigmoid" version="opset5">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="mul_8:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>16</dim>
				</port>
			</output>
